app/controllers/classrooms_controller.rb

  def show
          @student = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @classroom = Classroom.new classroom_params
    respond_to do |format|
      if @classroom.save
---
INSERT INTO "classrooms" ("courses_id", "created_at", "entry_at", "students_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["courses_id", 2], ["created_at", "2015-05-24 11:44:50.666955"], ["entry_at", "2015-05-24"], ["students_id", 1], ["updated_at", "2015-05-24 11:44:50.666955"]]

  def destroy
    @classroom.destroy
---
DELETE FROM "classrooms" WHERE "classrooms"."id" = $1  [["id", 2]]

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 3]]