app/controllers/courses_controller.rb

INSERT INTO "courses" ("created_at", "description", "name", "status", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @course = Course.new course_params

    respond_to do |format|
      if @course.save