app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "name", "register_number", "status", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @student = Student.new student_params
    respond_to do |format|
      if @student.save